# 1) მომხმარებელს შემოაყვანინე რიცხვი და. თუ მომხმარებლის შემოყვანილი რიცხვი  იყოფა 2-ზე და ნაშთი რჩება 0-ი. მაგ შემთხვევაში დაპრინტე "ლუწია" ხოლო სხვა შემთხვევაში დაპრინტე "კენტია".

num = int(input("enter your number"))

if  num%2==0:
    print("ლუწია")
else:
    print("კენტია")


# 2) for ციკლით გამოიტანე რიცხვები 1 დან 200-ამდე. და ყოველ იტერაციაზე დაუმატე 4-იანი.

for i in range(1,200,4):
    print(i)


# 3) while ციკლით გამოიტანე რიცვები 1 დან 20-მდე. და ყოველ იტერაციაზე დაუმატე 2-იანი.

num = 0

while num<20:
    num=num + 2
    print(num)


# 4) მოიყვანე or ოპერატორზე 5-5 მაგალითი. სადაც შედეგად გამოვა ჯერ False და მერე True.

# false
False or False

5 > 10 or 3 == 9 

2 > 4 or 7 < 1 

10 == 11 or 0 > 3 

1 == 2 or 4 == 9 

# true
True or False

5 > 2 or 1 > 100 

3 == 3 or 10 == 20 

7 < 1 or 9 > 3 

False or True

# 5) მოიყვანე and ოპერატორზე 5-5 მაგალითი. სადაც შედეგად გამოვა ჯერ False და მერე True.

# false
True and False 

5 > 2 and 10 < 3 

7 == 7 and 1 == 2 

0 < -1 and 4 > 1 

3 > 10 and 2 == 2 

# true
True and True 

5 > 2 and 10 > 3 

7 == 7 and 1 < 5 

3 != 4 and 2 <= 2 

9 > 1 and 100 > 20



# 6) აუცილებლად გადახედეთ დღევანდელ ჩანაწერს.