# 2) მომხმარებელს შემოატანინე ნებისმიერი სეზონი:გაზაფხული,ზაფხული,შემოდგომა,ზამთარი თუ მომხმარებლის შემოყვანილი სეზონი უდრის გაზაფხულს დაპრინტე 1-იანი, თუ უდრის ზაფხულს დაპრინტე 2-იანი, თუ უდრის შემოდგუმას დაპრინტე 3-იანი, თუ უდრის ზამთარს დაპრინტე 4-იანი. ხოლო სხვა შემთხვევაში დაპრინტე erorr.

season = input("enter any season: ")

if season == "გაზაფხული":
    print("1")
if season == "ზაფხული":
    print("2")
if season == "შემოდგომა":
    print("3")
elif season == "ზამთარი":
    print("4")
else:
    print("error")


# 3) მომხმარებელს შემოატანინე ნებისმიერი რიცხვი. თუ მომხმარებლის შემოყვანილი რიცხვი უდრის შენს საყვარელ რიცხვს დაპრინტე ჩემი საყვარელი რიცხვია ეს რიცხვი! ხოლო სხვა შემთხვევაში დაპრინტე, ეს არ არის ჩემი საყვარელი  რიცხვი

num = int(input("enter your number: "))
if num == 69:
    print("ეს არის ჩემი საყვარელი რიცხვი")
else:
    print("ეს არარის ჩემი საყვარელი რიცხვი")

# 4) მომხმარებელს შემოაყვანინე ნებისმიერი ფერი. თუ მომხმარებლის შემოყვანილი ფერი უდრის შენს ფერს, დაპრინტე ეს არის ჩემი საყვარელი ფერი. ხოლო სხვა შემთხვევაში დაპრინტე ეს არ არის ჩემი საყვარელი ფერი 

color = input("enter your color: ")
if color == "black":
    print("ეს არის ჩემი საყვარელი ფერი")
else:
    print("ეს არ არის ჩემი საყვარელი ფერი")