# 2) შექმენი ცვლადი, სადაც შენახული იქნება შენი საყვარელი ცხოველის სახელი. 
# შემდეგ მომხმარებელს შეაყვანინე ცხოველის სახელი და შეადარე ემთხვევა თუ არა შენი ცხოველი მომხმარებლის შეყვანილს.

name = input("enter your favorite dog ")
dog_name = "germanuli avchalka"
print(name == dog_name)

# 3) შექმენი ორი ცვლადი  ერთი შენი ასაკით, მეორე შენი საუკეთესო მეგობრის ასაკით. შეადარე არის თუ არა შენი ასაკი უფრო დიდი ვიდრე შენი მეგობრის
age = 15
age2=14
print(age>age2)

# 4) შექმენი 10 სხვადასხვა შედარება, რომლებიც ყველა დააბრუნებს True.

print(5<10)
print(5>=5)
print(2==2)
print(5!=4)
print(5<=10)
print(5<10)
print(5>=5)
print(2==2)
print(5!=4)
print(5<=10)


# 5) შექმენი 10 სხვადასხვა შედარება, რომლებიც ყველა დააბრუნებს False.
print(5>10)
print(5!=5)
print(2>3)
print(3>123)
print(5<3)
print(5>10)
print(5!=5)
print(2>3)
print(3>123)
print(5<3)