# 1) ჩამოწერეთ აქამდე ნასწავლი ფუნქციები, თქვენი დავალებაა: დაწეროთ რომელი არ გამოიტანს ეროს თუ არგუმენტში არ გადავცემთ არაფერს. და რომელი გამოიტანს ერორს, აუცილებლად მოიყვანეთ მაგალითი და ახსენით დეტალურად.

# 1) funqciebi = print,range,input,type  2)errors gamoitans range() da type danarcheni ara

# 2) კომენტარებით ახსენი როდის ვიყენებთ დოტნოტაციას(dot notation).

# rodesac viyeneb lower upper capitalize da find

# 3) შექმენი ცვლადი სადაც შეინახავ შენს სახელს, რომელიც გეწერება პატარა ასოებით, გამოიყენე მეთოდი რომელიც გაადიდებს თქვენი სახელის ასოებს.

name = "nikolozi"
print(name.upper())

# 4) შექმენი ცვლადი სადაც შეინახავ შენი საყავრელი სპორტის სახელს დიდი ასოებით. გამოიყენე მეთოდი რომელიც დააპატარავებს.

fav_sport = "BOX"

print(fav_sport.lower())

# 5) შექმენი ცვლადი სადაც შეინახავთ თქვენს გვარს პატარა ასოებით. გამოიყენე მეთოდი რომელიც გაადიდებს მხოლოდ პირველ ასოს.

lastname = "lursmanashvili"

print(lastname.capitalize())