# 2) შექმენი სია, სადაც შეინახავთ თქვენი საყვარელი ფეხბურთელების სახელებს და დაბეჭდეთ ბოლო ორი ელემენტი უარყოფითი ინდექსების დახმარებით.

players = ["Messi", "Ronaldo", "Neymar", "Mbappe"]

print(players[-2])
print(players[-1])

# 3) შექმენი ცვლადი სადაც შეინახავ ნებისმიერი ქალაქის სახელს და დაბეჭდეთ ქალაქის ბოლო ორი ასო.

city = "Tbilisi"

print(city[-2:])

# 4) მომხმარებელს შემოატანინე ნებისმიერი 4 ნიშნა რიცხვი და დაბეჭდეთ ბოლო სამი რიცხვი

number = input("Shemoitane 4 nishna ricxvi: ")

print(number[-3:])

# 5) მომხამრებელს შემოატანინე შენი გვარი. და საბოლოოდ დაბეჭდე პირველი ოთხი ასო.

surname = input("Shemoitane sheni gvari: ")

print(surname[:4])


# 6) აუცილებლად გადახედეთ დღევანდელ ჩანაწერს.