# mkacri
# !=
# ==
# <
# >
# aramkacri
# >=


# <=# 2) შექმენი ცვლადი და გადაეცი შენს მიერ  მოფიქრებული პაროლი, შემდეგ მომხმარებელს შეაყვანინე პაროლი და საბოლოოდ შეადარე უდრის თუ არა შენი პაროლი მომხმარებლის შემოყვანილ პაროლს.
password = input("enter your password :")
user_password = 1234
print("password = user_password")


# 3) შექმენი ცვლადი, სადაც შენახული იქნება შენი ასაკი. შემდეგ დაბეჭდე  არის თუ არა შენი ასაკი ნაკლები 10-ზე3)
age = int(input("enter your age"))
print(age < 10)

# 4) შექმენი 5 სხვადასხვა შედარება, რომლებიც ყველა დააბრუნებს True.
print(5<10)
print(5>=5)
print(2==2)
print(5!=4)
print(5<=10)

# 5) შექმენი 5 სხვადასხვა შედარება, რომლებიც ყველა დააბრუნებს False.
print(5>10)
print(5!=5)
print(2>3)
print(3>123)
print(5<3)