# 1) შექმენით სია სადაც შეინახავთ ნებისმიერ მონაცემთა ტიპის მნიშვნელობას, საბოლოოდ წაშალეთ მე-5 ელემენტი და სიის ბოლოს დააამატეთ თქვენი გვარი.

random_list = [1,2,3,4,5,6,7]

random_list.pop(5)
random_list.append("lursmanashvili")

print(random_list)


# 2) შექმენით სია სადაც შეინახავთ რიცხვებს 1-დან 10-მდე, საბოლოოდ დაბეჭდეთ პირველი ხუთი ელემენტი.

numbers = list(range(1, 11))


for i in range(5):
    print(numbers[i])

# 3) შექმენი for ციკლი სადაც გამოიტანთ რიცხვებს 1-დან 20-მდე ლუწი რიცხვები.

for i in range (0,20,2):
    print(i)

# 4) შექმენი ფუნქცია რომელსაც გადაეცემა ორი პარამეტრი, საბოლოოდ დაბეჭდეთ ამ რიცხვების ნამრავლი.



# 5) შექმენი ფუნქცია რომელსაც გადაეცემა ერთი პარამეტრი , თუ რიცხვი იქნება ლუწი დაბეჭდეთ "Even" ხოლო სხვა შემთხვევაში დაბეჭდეთ "Odd".