# 1) კომენტარებით ახსენით რა არის სია და რამდენი მონაცემთა ტიპის შენახვა შეგვიძლია.
#  სია არის სია სადაც შეგვიძლია ნებისმიერი ტიპის რამ ჩავწეროტ {} აქ და რამდენიც გვინდა

# 2) შექმენი სია სახელად names და შეინახეთ თქვენი ოჯახის წევრების სახელები. სააბოლოოდ დაბეჭდეთ 1-ლი და 3-მე ელემენტები.

names = ["natia","nikolozi","nunu","aleqsandre"]

print(name[1])
print(names[3])


# 3) შექმენი სია სახელად numbers და შეინახეთ 10-ი რენდომ რიცხვი. სააბოლოოდ 0-ლე ინდექსზე მდგომი ელემენტი გახადეთ თქვენი სახელი.

numbers=[1,2,3,41,123,5,11,7,44,5,]

numbers[0] = "nikoloz"

# 4) შექმენი სია სადაც შეინახავ ნებისმიერ მონაცემთა ტიპის მნიშვნელობას მაქსიმუმ 10 მნიშვნელობა რომ იყოს. საბოლოოდ დაბეჭდეთ კენტ ინდექსზე მდგომი ელემენტები

names = [10,12,13,14,15,16,17,8,9,]
print[2]
print[4]
print[6]
print[8]