# 1) შექმენით ფუნქცია greet და დააბრუნეთ მისასალმებელი ტექსტი return ის საშუალებით

def greet():
    return "hello "
print(greet())



# 2) შექმენით ფუნქცია add რომელსაც გადაეცემა ორი რიცხვი და შემდეგ დააბრუნეთ მათი ჯამი

def add(a,b):
    return a+b
print(add(3,5))




# 3) შექმენით ფუნქცია multiply რომელსაც გადაეცემა ორი რიცხვი  შემდეგ კი დააბრუნეთ მათი ნამრავლი

def multiply(a,b):
    return a*b
print(multiply(5,5))

# 4) კომენტარებით ახსენით რა არის არგუმენტი და რა არის პარამეტრი,ასევე რატომ ვიყენებთ ფუნქციებს

# პარამეტრი არის ცვლადი რომელიც ელოდება რომ მიენიჭოს მნიშვნელობა~

# არგუმენტი კი უკვე ფუნქციის ბრჩხილებში მოთავსებული  მნიშვნელობაა რომელიც პარამეტრს გადაეცემა ფუნქციის გამოძახების დროს 


# 5) შექმენი ფუნქცია სახელად filter რომელსაც გადაეცემა რიცხვი, თქვენი დავალებაა შეამოწმოთ ეს რიცხვი ლუწია თუ კენტი და დააბრუნოთ შესაბამისი შედეგი even ან odd

def filter(num):
    if num % 2 == 0:
        return "even"
    else:
        return "odd"
    
print(filter(5))