# 1)შექმენით სია სადაც გექნებათ რიცხვები მოცემული და 
# ახალ სიაში ჩაამატეთ ისეთი რიცხვები რომლებიც იყოფა 3ზეც და 5 ზეც

nums = [1,2,3,4,5,6,7,8,8,9,10,11,12,13,14,15,16,17,30]

list_2 = []

for i in nums:
    if i % 3 == 0 and i % 5 == 0 :
        list_2.append(i)
    


# 2)შექმენით სია სადაც გექნებათ მოცემული სახელები, შემდეგ ახალ სიაში ჩაამატეთ ისეთი სახელები სახელები რომლის სიმბოლოების რაოდენობაც არის ლუწი რიცხვი

names = ["nikolozi","giorgi","nika","leqso"]

new_names = []

for i in names:
    if len(i) % 2 == 0:
        new_names.append(i)