# 1) შექმენი ცვლადი სადაც შეინახავ შენს საყვარელ სპორტის სახელს შემდეგ for ციკლით გადაუარეთ ცვლადს და გამოიტანეთ თქვენი სახელი ცალ-ცალკე.

sport = input("enter any sport: ")

for sport in sport:
    print(sport)


# 2) შექმენი while ციკლი. სადაც გამოიტან რიცხვებს 1 დან 100 მდე და ყოველ იტერაციაზე უნდა დაუმატო 4-იანი.
num = 1

while num<100:
    num = num + 1
    print(num)

# 3) შექმენი for ციკლი სადაც გამოიტან 1-დან  499 ის ჩათვლით ლუწ რიცხვებს.
for i in range(0,499,2):
    print(i)

# 4) დაწერე პროგრამა, რომელიც ითხოვს მომხმარებლის საყვარელ რიცხვს და არ ჩერდება მანამ, სანამ სწორ რიცხვს არ შეიყვანს.თუ მომხმარებელი შეიყვანს სხვა ციფრს, პროგრამამ უნდა სთხოვოს თავიდან შეიყვანოს.როდესაც სწორი რიცხვი იქნება შეყვანილი — პროგრამამ უნდა დაბეჭდოს, რომ ეს პასუხი სწორია.

num1 = 69

user_num = int(input("enter your number: "))

while num1 != user_num:
    print("try again ")
    user_num = int(input("enter your number: "))

print("correct")




# 5)for ციკლის საშუალებით 0 დან 20 მდე დაპრინტე ყველა ლუწი რიცხვი

for i in range(0,20,2):
    print(i)

# 6)for ციკლის საშუალებით 1 დან 20 მდე დაპრინტე ყველა კენტი რიცხვი

for i in range(1,20,2):
    print(i)



# 7)while ციკლის დახმარებით 0 დან 20მდე დაპრინტეთ ყველა ლუწი რიცხვი
num = 0

while num < 200:
    num = num + 1
    print(num)
    



